---
type: FaceWall
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# FaceWall

`Autodesk.Revit.DB.FaceWall` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2011 | `public static FaceWall Create ( Document document , ElementId wallType , WallLocationLine locationLine , Reference faceReference )` |
| Method | IsValidFaceReferenceForFaceWall | 2011 | `public static bool IsValidFaceReferenceForFaceWall ( Document document , Reference faceReference )` |
| Method | IsWallTypeValidForFaceWall | 2011 | `public static bool IsWallTypeValidForFaceWall ( Document document , ElementId wallType )` |
| Property | Parameter | — | `` |